[
  {  "knowledgeTitle": "Angular", "knowledgeDiscription": "I know Angular very well, How to create a Component,how to use Services, and then Subscribe to it in Component which have show the Data or Fetch the Data From the User. Then The Communication between the components we use Input() and Output() Decorater Method. If User click on any Link and goes to the next Page, we use Routing. In Angular Routing Concept is easier to understands and easier to develop. 'I Create my this Resume Website in Angular(10)'.  ", "imagePath":"../../assets/images/Topic_images/angular.png" },
  {  "knowledgeTitle": "MySql", "knowledgeDiscription": "MySql is the Most Important Concept for the Store the Data, Update the Data, Show the Data and Delete the Data. there is Lots of Queries to combine the Data from Multiple Tables like Inner Join, Outer Join , Left Join and Right Join. The MySQL is an open-source Relational Database Management System. In Mysql there is Two types keys Foreign-Key and Primary-Key. Foreign-Key is a key used to link two tables together. A Foreign-Key is a field in one table that refers to the Primary-Key in another table. And Primary-Key constraint uniquely identifies each record in a table, cannot contain NUL values and table have only one Primary Key.", "imagePath":"../../assets/images/Topic_images/mysql.png" },
  {  "knowledgeTitle": "PHP", "knowledgeDiscription": "Php is stands for PHP: Hypertext Preprocessor. I know Php very well , PHP is use for connecting the Database. PHP is written for a Backend part in the WebSites. The PHP is Running at server Side so PHP also Called Server Side Scripting Language. In PHP there is few Frameworks are like Larevel, CodeIgniter, CakePhp, Sumphony etc. to write code for Backend part or Connecting to Databse. PHP is Popular Programming Language with Faster turn-arround time, enhanced security and affordability and most of Developers choice PHP for Creating Dynamically website.", "imagePath":"../../assets/images/Topic_images/php.png" },
  {  "knowledgeTitle": "Laravel", "knowledgeDiscription": "Laravel is One of the PHP Framework. Laravel and all other PHP Frameworks are basically MVC(Model View Controller) architecture. Only in the Laravel you have to Create One Model perticular Table, Not More Tables define in One Model. In View the extension is Blade that is very helpful for Data Binding and and many other things. ", "imagePath":"../../assets/images/Topic_images/laravel.png" },
  {  "knowledgeTitle": "Javascript", "knowledgeDiscription": "I learn Javascript for the Form Validation,Email Validation, Javascript Events, OOPs Concept in Javascript. The Web Developer must known about 3 Languages HTML, CSS, Javascript. This is bassically Client side Scripting Language. JavaScript is used to create interacive websites. Javascript use for Dynamic drop-down menus, Displaying date and time, Displaying Pop-up windows and dialog boxes, Displaying Clocks etc.", "imagePath":"../../assets/images/Topic_images/javascript.png" },
  {  "knowledgeTitle": "Jquery", "knowledgeDiscription": "Jquery is basically Lightweight JavaScript Library. In JavaScript there is Big code complexity when using Long Selector, Complex Animations, Lengthy DOM Manipulation and Lengthy Ajax Coding, but this all in JQuery are Divided in different Functions. JQuery is Uses for Short Selectors, Variety of Animation Functions, Easy DOM Manipulation, Easy CSS Styling, Easy DOM Traversing and Simple Ajax Code etc. The Benefits of JQuery is Browser Independent and Increase Coding Speed.", "imagePath":"../../assets/images/Topic_images/jquery.png" },
  {  "knowledgeTitle": "Ajax", "knowledgeDiscription": "Ajax is Asynchronous JavaScript and XML. Ajax is not a Programming Language. Ajax just uses a combination of a Browser Built-in XMLHttpRequest object( to request data from a web server ), JavaScript and HTML DOM( to display or use the data ). Ajax allows web pages to be updated asynchronously by exchanging data with web server behind the scenes. This means that it is possible to update parts of a web page, without reloading the whole page.", "imagePath":"../../assets/images/Topic_images/ajax.png" },
  {  "knowledgeTitle": "Python", "knowledgeDiscription": "Python is an interpreted, high-level and general-purpose programming language. Python is more Popular to other languages. Python is Used in most cases like Develop Mobile Applications(Android, iOS), WebSites, Learn to Machine Learning, Artificial Inteligence, Data Science etc. My last Year Project Desktop Assistance is based on Python Programming Language. ","imagePath":"../../assets/images/Topic_images/python.png" }
]
